In [6]:
import pandas as pd
db = { 'Name' : ['Harry', 'Tom', 'Jane', 'Will', 'Arthur'],
       'Occupation' : ['Tester', 'Tester', 'Analyst', 'Developer', 'Analyst'],
       'Salary' : [20000, 25000, 30000, 40000, 32000]}
df = pd.DataFrame(db)
df

     Name Occupation  Salary
0   Harry     Tester   20000
1     Tom     Tester   25000
2    Jane    Analyst   30000
3    Will  Developer   40000
4  Arthur    Analyst   32000

In [8]:
avg = df.groupby('Occupation')['Salary'].mean() # required dataframe

print(avg)

Occupation
Analyst      31000.0
Developer    40000.0
Tester       22500.0
Name: Salary, dtype: float64